In [1]:
%load_ext autoreload
%autoreload 2

In [2]:
from rtb.datasets import get_dataset

In [3]:
dataset = get_dataset(name="amazon_reviews", root="../../data")  # , process=True)

loading db...
loading db took 46.48 seconds.

In [4]:
dataset.task_names

['customer_churn', 'customer_ltv']

In [5]:
db = dataset._db

In [6]:
customer = db.table_dict["customer"].df
product = db.table_dict["product"].df
review = db.table_dict["review"].df

In [7]:
customer

         customer_id         customer_name
0                  0           TW Ervin II
1                  1       Amazon Customer
2                  2          Tekla Borner
3                  3  Deborah K Woroniecki
4                  4                     E
...              ...                   ...
1850188      1850188       Amazon Customer
1850189      1850189                AmizoP
1850190      1850190            JuicyBeans
1850191      1850191         Halley Cortez
1850192      1850192               RNqueen

[1850193 rows x 2 columns]

In [8]:
product

,product_id,category,brand,title,description,price
0,0,"[Books, Literature & Fiction, Dramas & Plays]",Visit Amazon's William Shakespeare Page,Love's Labour's Lost: Performed by Derek Jacob...,William Shakespeare is widely regarded as the ...,20.93
1,1,"[Books, Children's Books, Literature & Fiction]",Louis (ed) UNTERMEYER,The golden treasury of poetry,Collection of Poetry,23.98
2,2,"[Books, Mystery, Thriller & Suspense]",Visit Amazon's Agatha Christie Page,The Blue Geranium (Miss Marple),None,8.82
3,3,"[Books, Humor & Entertainment]",Visit Amazon's Tom Baker Page,Who on Earth Is Tom Baker?,Tom Baker's autobiography covers his childhood...,159.95
4,4,"[Books, Christian Books & Bibles, Bible Study ...",Visit Amazon's Clarence Larkin Page,The Greatest Book on &quot;Dispensational Trut...,The Greatest Book on Dispensational Truth in t...,44.76
...,...,...,...,...,...,...
506007,506007,None,"Tricia & Putman, Cara Goyer",Mason Jar Mayhem,"Spring has come to Sugarcreek, and the communi...",15.05
506008,506008,None,Author,The Little Book of Pussy (2013-06-16) [Paperback],From the time The Big Penis Book was published...,17.00
506009,506009,None,,The Age of Not Believing: A Christmas Tale by ...,None,42.93
506010,506010,None,,The Charlies Angels' Casebook,None,17.87
506011,506011,None,,Underwater Photography Masterclass by Alex Mus...,None,46.62

In [9]:
review

,review_time,customer_id,product_id,rating,verified,review_text,summary
0,2005-03-30,0,14,5.0,False,"The King, the Mice and the Cheese by Nancy Gur...",A story children will love and learn from
1,2016-06-20,1,14,5.0,True,The kids loved it!,Five Stars
2,2016-01-24,2,14,5.0,True,My students (3 & 4 year olds) loved this book!...,Five Stars
3,2015-07-09,3,14,5.0,False,LOVE IT,Five Stars
4,2015-01-18,4,14,5.0,True,Great!,Five Stars
...,...,...,...,...,...,...,...
21935279,2012-12-02,319196,506010,5.0,False,"This past year fans of ""Charlie's Angels"" were...","""NOW THIS IS THE COMPANION TO THE ""CHARLIE'S A..."
21935280,2008-12-15,1407251,506010,5.0,True,"For any fan of Charlie's Angels, this book is ...",An Excellent Case!
21935281,2007-06-15,1373107,506010,3.0,False,To review this book I will divide it into two ...,Great Stories But A Little One-Sided
21935282,2018-05-27,319324,506011,3.0,True,"Great pictures, good recommendations but not t...",Don't buy if your looking for details and sett...
21935283,2017-09-11,1703463,506011,5.0,True,Superb book. Very useful.,Superb book.

## LTV

In [28]:
task = dataset.get_task("customer_ltv")

### train table

In [12]:
train_table = task.get_default_train_table(process=True)

In [13]:
# here count is the number of products which contributed to the sum aggregation in ltv
train_table.df

        timestamp  customer_id    ltv  count_
0      2011-01-02      1843341   0.00       0
1      2011-01-02      1843344   0.00       0
2      2011-01-02      1843346  28.48       1
3      2011-01-02      1843357   0.00       0
4      2011-01-02      1843359   0.00       0
...           ...          ...    ...     ...
573741 2009-01-02       101144  32.19       1
573742 2009-01-02       102100   0.00       0
573743 2007-01-03       100835  83.25       4
573744 2005-01-03       100994   0.00       0
573745 2005-01-03       102399   0.00       0

[573746 rows x 4 columns]

In [14]:
# frequency of counts in percent
train_table.df["count_"].value_counts(normalize=True) * 100

count_
0      51.757921
1      18.603877
2       9.623074
3       5.491454
4       3.318367
         ...
522     0.000174
388     0.000174
227     0.000174
269     0.000174
451     0.000174
Name: proportion, Length: 377, dtype: float64

## val table

In [15]:
val_table = task.get_default_val_table(process=True)

In [16]:
val_table.df

        timestamp  customer_id    ltv  count_
0      2013-01-01      1843206  51.95       2
1      2013-01-01      1843213   0.00       0
2      2013-01-01      1843233   0.00       0
3      2013-01-01      1843235   0.00       0
4      2013-01-01      1843242   0.00       0
...           ...          ...    ...     ...
441579 2013-01-01      1837071  26.96       1
441580 2013-01-01      1837074  15.00       1
441581 2013-01-01      1837166   0.00       0
441582 2013-01-01      1837330   0.00       0
441583 2013-01-01      1837397  36.19       2

[441584 rows x 4 columns]

In [17]:
val_table.df["count_"].value_counts(normalize=True) * 100

count_
0       23.416609
1       16.588010
2       13.492563
3       10.485661
4        7.648828
          ...
419      0.000226
1778     0.000226
256      0.000226
412      0.000226
411      0.000226
Name: proportion, Length: 403, dtype: float64

### test table

In [29]:
input_test_table = task.get_input_test_table(process=True)
input_test_table.df

         timestamp  customer_id
0       2015-01-01            0
1       2015-01-01            5
2       2015-01-01            6
3       2015-01-01            7
4       2015-01-01            8
...            ...          ...
1187352 2015-01-01      1638154
1187353 2015-01-01      1638218
1187354 2015-01-01      1638268
1187355 2015-01-01      1637733
1187356 2015-01-01      1637973

[1187357 rows x 2 columns]

In [30]:
task._test_table.df

         timestamp  customer_id     ltv  count_
0       2015-01-01            0   73.48       4
1       2015-01-01            5  674.86      55
2       2015-01-01            6    0.00       0
3       2015-01-01            7   60.94       4
4       2015-01-01            8  120.08      10
...            ...          ...     ...     ...
1187352 2015-01-01      1638154   50.74       3
1187353 2015-01-01      1638218    0.00       0
1187354 2015-01-01      1638268   25.94       2
1187355 2015-01-01      1637733   21.98       2
1187356 2015-01-01      1637973    0.00       0

[1187357 rows x 4 columns]

In [32]:
task._test_table.df["count_"].value_counts(normalize=True) * 100

count_
0       27.127309
1       17.466356
2       14.152020
3       10.695520
4        7.458667
          ...
947      0.000084
554      0.000084
1474     0.000084
484      0.000084
437      0.000084
Name: proportion, Length: 469, dtype: float64

## Churn

In [18]:
task = dataset.get_task("customer_churn")
task

CustomerChurnTask(dataset=AmazonReviewsDataset())

### train table

In [19]:
train_table = task.get_default_train_table(process=True)

In [20]:
train_table.df

        timestamp  customer_id  churn
0      2011-01-02      1843206      0
1      2011-01-02      1843212      1
2      2011-01-02      1843341      1
3      2011-01-02      1843344      1
4      2011-01-02      1843346      0
...           ...          ...    ...
573741 2003-01-04      1738929      1
573742 2003-01-04      1739935      1
573743 2003-01-04      1740294      1
573744 2001-01-04      1740294      0
573745 2001-01-04      1740474      1

[573746 rows x 3 columns]

In [21]:
# frequency of churn in percent
train_table.df["churn"].value_counts(normalize=True) * 100

churn
1    51.757921
0    48.242079
Name: proportion, dtype: float64

## val table

In [22]:
val_table = task.get_default_val_table(process=True)

In [23]:
val_table.df

        timestamp  customer_id  churn
0      2013-01-01      1843206      0
1      2013-01-01      1843211      0
2      2013-01-01      1843213      1
3      2013-01-01      1843233      1
4      2013-01-01      1843235      1
...           ...          ...    ...
441579 2013-01-01      1832903      0
441580 2013-01-01      1832921      0
441581 2013-01-01      1832923      0
441582 2013-01-01      1832934      0
441583 2013-01-01      1832936      0

[441584 rows x 3 columns]

In [24]:
val_table.df["churn"].value_counts(normalize=True) * 100

churn
0    76.583391
1    23.416609
Name: proportion, dtype: float64

### test table

In [25]:
input_test_table = task.get_input_test_table(process=True)
input_test_table.df

         timestamp  customer_id
0       2015-01-01      1843202
1       2015-01-01      1843206
2       2015-01-01      1843211
3       2015-01-01      1843218
4       2015-01-01      1843222
...            ...          ...
1187352 2015-01-01      1126393
1187353 2015-01-01      1126394
1187354 2015-01-01      1126395
1187355 2015-01-01      1126398
1187356 2015-01-01      1126399

[1187357 rows x 2 columns]

In [26]:
task._test_table.df

         timestamp  customer_id  churn
0       2015-01-01      1843202      1
1       2015-01-01      1843206      1
2       2015-01-01      1843211      0
3       2015-01-01      1843218      0
4       2015-01-01      1843222      1
...            ...          ...    ...
1187352 2015-01-01      1126393      0
1187353 2015-01-01      1126394      1
1187354 2015-01-01      1126395      1
1187355 2015-01-01      1126398      0
1187356 2015-01-01      1126399      1

[1187357 rows x 3 columns]

In [27]:
task._test_table.df["churn"].value_counts(normalize=True) * 100

churn
0    72.872691
1    27.127309
Name: proportion, dtype: float64